In [6]:
import pandas as pd
test_df = pd.read_csv('data.csv',sep=';')
test_df

  Unnamed: 0  Column1  Column2  Column3  Column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       12       13       14       15

In [5]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      object
 1   Column1     4 non-null      int64
 2   Column2     4 non-null      int64
 3   Column3     4 non-null      int64
 4   Column4     4 non-null      int64
dtypes: int64(4), object(1)
memory usage: 292.0+ bytes

In [6]:
test_df.describe()

         Column1    Column2    Column3    Column4
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [7]:
test_df.value_counts('Column1')

Column1
0     1
4     1
8     1
12    1
Name: count, dtype: int64

In [8]:
test_df[test_df['Column1']>5]

  Unnamed: 0  Column1  Column2  Column3  Column4
2       Row3        8        9       10       11
3       Row4       12       13       14       15

CSV

In [1]:
from io import StringIO, BytesIO
import numpy as np

In [2]:
data = ('col1,col2,col3\n'
        'x,y,1\n'
        'a,b,2\n'
        'c,d,3\n')

In [3]:
type(data)

str

In [7]:
df = pd.read_csv(StringIO(data))
df

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [8]:
df1= pd.read_csv(StringIO(data), usecols=['col1','col3'])
df1

  col1  col3
0    x     1
1    a     2
2    c     3

In [9]:
df1.to_csv('test.csv')

In [10]:
df=pd.read_csv(StringIO(data),usecols=['col3'], dtype=float)
df

   col3
0   1.0
1   2.0
2   3.0

In [11]:
df=pd.read_csv(StringIO(data), dtype={'col3':float})
df

  col1 col2  col3
0    x    y   1.0
1    a    b   2.0
2    c    d   3.0

In [12]:
df.dtypes

col1     object
col2     object
col3    float64
dtype: object

In [13]:
data =  ('index,a,b,c\n'
         '4,apple,bat,5.7\n'
         '8,orange,cow,10')

In [14]:
df2= pd.read_csv(StringIO(data), index_col=0)
df2

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [15]:
data =  ('a,b,c\n'
         '4,apple,bat\n'
         '8,orange,cow')

In [16]:
df3= pd.read_csv(StringIO(data))
df3

   a       b    c
0  4   apple  bat
1  8  orange  cow